{
  "insights": {
    "meta": {
      "title": "raspb Webservices - Einblicke",
      "description": "Hier kann eine Beschreibung stehen..."
    },
    "header": {
      "title": "Einblicke in unsere Arbeit",
      "titleFirst": "Einblicke in",
      "titleHighlight": "unsere Arbeit",
      "subtitle": "Vertrauen und Transparenz sind wichtig für eine gute Kundenbeziehung. Hier möchten wir Einblicke in unsere Arbeit und einen typischen Projektablauf geben, damit glasklar ist, womit sie rechnen können."
    },
    "webtechnologien": {
      "title": "Wir setzen modernste Webtechnologien ein",
      "titleFirst": "Wir setzen",
      "titleHighlight": "modernste Webtechnologien",
      "titleSecond": " ein",
      "subtitle": "Wir haben unseren eigenen Technologie-Stack entwickelt, der auf dem Jamstack basiert und alles einfacher, schneller und effizienter macht, ohne dabei Einschränkungen in Kauf nehmen zu müssen.",
      "absatz1headline": "Was ist der Jamstack?",
      "absatz1": "<strong>Jamstack</strong> steht für JavaScript, APIs und Markup und repräsentiert eine moderne Architektur für Webentwicklung. Diese Technologie ermöglicht es uns, extrem schnelle, sichere und skalierbare Websites und Webanwendungen zu erstellen, die eine außergewöhnliche Benutzererfahrung bieten.",
      "absatz2headline": "Unübertroffene Performance",
      "absatz2": "Der Kern des Jamstack-Ansatzes liegt in der <strong>Vorab-Generierung</strong> von Inhalten. Anstatt Seiten bei jeder Anfrage dynamisch zu erstellen, werden alle Seiten bereits zur Build-Zeit generiert und über ein Content Delivery Network (CDN) ausgeliefert. Dies führt zu blitzschnellen Ladezeiten und einer verbesserten Performance. Darüber hinaus ergeben sich noch weitere Vorteile.",
      "absatz3headline": "Entkopplung von Frontend und Backend",
      "absatz3": "Durch die <strong>Entkopplung von Frontend und Backend</strong> können wir flexibel die besten Tools für jeden Bereich einsetzen. Das Frontend wird als statische Dateien ausgeliefert, während dynamische Funktionen über APIs realisiert werden. Diese Architektur bietet mehrere entscheidende Vorteile:",
      "vorteile": {
        "sicherheit": "<strong>Sicherheit:</strong> Weniger Angriffsfläche durch statische Dateien + kein klassischer Server",
        "performance": "<strong>Performance:</strong> Globale CDN-Verteilung + Vorgerendertes Markup für minimale Ladezeiten",
        "skalierbarkeit": "<strong>Skalierbarkeit (traffic):</strong> Automatische Skalierung ohne Serveradministration (Load Balancing)",
        "skalierbarkeit2": "<strong>Skalierbarkeit (app):</strong> Problemlose Skalierung Ihrer Anwendung oder Webseite",
        "entwicklerfreundlichkeit": "<strong>Entwicklerfreundlichkeit:</strong> Moderne Tools und Workflows + dynamische Community",
        "kosteneffizienz": "<strong>Kosteneffizienz:</strong> Reduzierte Entwicklungs-, Hosting- und Wartungskosten"
      },
      "absatz4headline":"Technologie-Agnostik",
      "absatz4": "Unser Jamstack-Setup besteht aus modernen und innvoativen Tools und Technologien, die sich bewährt haben und perfekt aufeinander abgestimmt sind. Dabei bildet eine <strong>node.js</strong> Frontend-Applikation meist die Grundlage. Angereichert mit Frameworks wie <strong>Svelte/SvelteKit</strong>, <strong>TailwindCSS</strong> oder <strong>DaisyUI</strong> und weiteren npm Paketen, schaffen wir ein Frontend mit unendlichen Möglichkeiten.<br/><br/>Bei all dem bewegen wir uns aber nicht in einem starren Konstrukt, sondern können flexibel auf Integrationswünsche oder andere Technolgiefragen reagieren. Fast alles ist möglich... Des weiteren setzen wir auf <strong>TypeScript</strong> zur typsicheren Programmierung und <strong>Netlify</strong> für Deployment und Hosting. Diese Kombination - unterstützt von <strong>KI-Tools</strong> - ermöglicht es uns, robuste und wartbare Webanwendungen zu entwickeln, die sowohl für Entwickler als auch für Endnutzer optimiert sind. ",
      "absatz5headline":"Headless CMS Integration",
      "absatz5": "Die <strong>Headless CMS-Integration</strong> über GraphQL APIs ermöglicht es unseren Kunden, Inhalte einfach zu verwalten, während die technische Komplexität im Hintergrund verborgen bleibt. So können Sie sich auf Ihr Geschäft konzentrieren, während wir für eine technisch einwandfreie und zukunftssichere Lösung sorgen."
    },
    "projectInsights": {
      "titleFirst": "Wie sieht ein typisches Pojekt bei",
      "titleHighlight": "raspb",
      "titleSecond": " aus",
      "paragraph1": "Den einfachen Start in Ihr anstehendes IT-Projekt finden Sie auf unserer Webseite. Mit dem Absenden des Projektkonfigurators ist bereits der erste große Schritt getan. Um den intelligenten Konfigurator im vollen Umfang nutzen zu können, müssen Sie sich lediglich einen einfachen Account anlegen (Angabe der E-Mail-Adresse genügt). Das geplante Projekt steht in Ihrem persönlichen Dashboard dann zur Verfügung und kannn dort verfeinert und letztendlich an uns übermittelt werden.",
      "paragraph2": "Sie erhalten sofort eine E-Mail mit allen Details und können mit einem Klick offiziell loslegen und uns beauftragen. <strong>Damit startet die Reise!</strong> Wir beschäftigen uns sofort mit Ihrer Idee, entwickeln ein Konzept sowie einen ersten Prototypen. Für jedes Projekt wird ein eigenes Postfach <projektname>@raspb.de eingerichtet, welches für die Erstellung aller Accounts verwendet wird. Sie erhalten Zugriff auf das Postfach + Zugang zu den E-Mails über den Browser / einen Webmailer. Es wird ein GitHub Konto aufgesetzt, welches den Projektcode trägt und ein eigene Site in Netlify erstellt. Je nach Projekttyp kommt eine Hygraph- und auth0 Account dazu. In der Regel passiert der Zugriff via SSO vom GitHub Konto aus.",
      "paragraph3": "Je nach Projektumfang und Kundenwusch, verfeinern wir gemeinsam Ihre Vision in kleinen Workshops oder Web-Sessions. Was wir aber unbedingt vermeiden wollen, ist es viele zeitfressende Meetings vorzusehen, die meist nur einen geringen Nutzen bieten. Ihr Input aus dem Konfigurtator, so wie unsere umfassende Erfahrung aus IT-Projekten, versetzen uns in die Lage, Ihre Idee/Vision auch ohne zig Schleifen verstehen und umsetzen zu können. Sind sie zwischen Projektkonfiguration und Beauftragung aber noch unsicher, haben Rückfragen  oder brauchen aus sontigen Gründen den Dialog, stehen wir natürlich jederzeit zur Verfügung. Lassen Sie es uns - zum Nutzen aller - aber effizient und schlank halten.",
      "paragraph4": "Alle Systeme haben Sie - auch während des Projektverlaufs - im vollen Zugriff. Wir erabreiten nun innerhalb des geschaffenen GitHub Repositories Ihre Projekt und stellen es über eine temporäre Adresse: <projektname>.netlify.app zur Verfügung. Sie bekommen alle Zugangsaten direkt zur Verfügung gestellt und werden über jeden Schritt in Ihrem Dashboard und per Mail informiert.",
      "paragraph5": "Bei CMS Projekten, werden wir einige Iterationen mit Ihnen drehen, um das Datenmodell und weitere Besonderheiten abzustimmen. Einfache Webseiten benötigen i.d.R. keine zusätzlichen Abstimmunsrunden. Sie erhalten innerhalb von wenigen Tagen einen ersten Prototypen. Bei komplexeren Vorhaben, wie speziellen Anwendungen oder Individual-Entwicklungen, kann es etwas längerer dauern, bis wir einen ersten Prototyp präsentieren können.",
      "paragraph6": "Sie haben nun ausreichend Zeit den Prototypen zu testen und uns Feedback zu geben. Über das Dashboard haben Sie zudem jedezeit die Möglichkeit weitere Projektartefakte bereitzustellen oder Einfluss auf die Entwicklung zu nehmen.",
      "paragraph7": "Mit dem gesammelten Rückmeldungen gehen wir in die Überarbeitung / den Feinschliff. Nach ein paar weiteren Tagen liegt die GoLive-fähige Endversion vor. In Abstimmung mit Ihenn veröffentlichen wir das Ergebnis unter der gewünschten Domain. Alternativ liefern wir den Code an  Sie aus oder transportieren die Anwendung an Ihren Wunschort. Damit ist das Projekt erfolgreich abgeschlossen.",
      "paragraph8": "Aber damit nicht genug. Der Aufbau unserer Lösungen ist modular, flexibel und erweiterbar. Das Ende Ihres Projekts ist der Anfang eines weiteren..."
    },
    "kiSection": {
      "title": "Und was ist jetzt mit KI?",
      "paragraph1": "Künstliche Intelligenz ist eine beeindruckendes Werkzeug, was die Erledigung von bestimmten Aufghaben um das 10-fache beschleunigen kann. Es versetzt uns in die Lage, unsere maßgeschneiderten IT-Projekte dermaßen effizient anbieten zu können (Projektlaufzeit, Kosten, etc.). Ganz ohne Menschen geht es aber nicht: Kreativität, Erfahrungen, tiefes Verständnis für menschliche Bedürfnisse, Emotionen,... All das lässt sich nicht ersetzen! Darüber hinaus braucht es erfahrene Personen, die den KI-Modellen die richtigen Anweisungen (Prompts) geben und deren Output kontrolliert. Denn manchmal liefern KIs Dinge, nach denen nicht gefragt wurde (halluzinieren) oder liefern Ergebnisse mit gravierenden Fehlern ab. Auch wenn viele Modelle mittlerweile mit nur einem Prompt ganze Anwnendungen erstellen können, ist für ein wirklich perfektes Ergebnis ein menschlicher Experte nötig.",
      "paragraph2": "Neben dem Prompt- und Context-Engineering (Wie kann ich eine KI bestmöglich füttern, damit genau das dabei rauskommt, was ich will?) gibt es viele weitere Use-Cases, bei denen sich die Nutzuing von KI - in der ein oder anderen Form - aufdrängt: Chatbots, KI-Agent, KI-Workflows, KI enhanced Automations, Content-Craetion, Personal Assistant, etc.",
      "paragraph3": "Wir haben n8n als Automatisierungplattform für uns entdeckt. Damit lassen sich Szenarien aus allen Bereichen der KI, einfach und effizient umsetzen. Wir bieten neben individuellen KI-Beratungsleistungen auch die Entwicklung spezieller Agenten und Workflows an, welche Ihnen dabei helfen Ihre Unternehmensziele zu erreichen und Kosten zu sparen. Bei unseren KI-Projekten (und teilweise auch bei unserwen Individualentwicklungen), lässt sich der standardisierte Projektablauf nicht zu 100% anwenden. Üblicherweise sind die Projektzeiten hier etwas länger und eine engere Abstimmung ist Voraussetzung. Und dennoch bietet der einztigartige raspb Ansatz auch hier eine einizigartige Effizienz. Ergebnisse der KI Projekte sind deutlich früher verfügbar, als bei anderen Anbieter."
    }
  }
}
