{
  "insights": {
    "meta": {
      "title": "raspb Webservices - Einblicke",
      "description": "Hier kann eine Beschreibung stehen..."
    },
    "header": {
      "title": "Einblicke in",
      "titleHighlight": "unsere Arbeit",
      "teaser": "Vertrauen und Transparenz sind wichtig für eine gute Kundenbeziehung. Hier möchten wir Einblicke in unsere Arbeit und einen typischen Projektablauf geben, damit glasklar ist, womit sie rechnen können."
    },
    "webtechnologien": {
      "titleFirst": "Wir setzen",
      "titleHighlight": "modernste Webtechnologien",
      "titleSecond": " ein",
      "subtitle": "Wir haben unseren eigenen Technologie-Stack entwickelt, der auf dem Jamstack basiert und alles einfacher, schneller und effizienter macht, ohne dabei Einschränkungen in Kauf nehmen zu müssen.",
      "absatz1headline": "Was ist der Jamstack?",
      "absatz1": "<strong>Jamstack</strong> steht für JavaScript, APIs und Markup und repräsentiert eine moderne Architektur für Webentwicklung. Diese Technologie ermöglicht es uns, extrem schnelle, sichere und skalierbare Websites und Webanwendungen zu erstellen, die eine außergewöhnliche Benutzererfahrung bieten.",
      "absatz2headline": "Unübertroffene Performance",
      "absatz2": "Der Kern des Jamstack-Ansatzes liegt in der <strong>Vorab-Generierung</strong> von Inhalten. Anstatt Seiten bei jeder Anfrage dynamisch zu erstellen, werden alle Seiten bereits zur Build-Zeit generiert und über ein Content Delivery Network (CDN) ausgeliefert. Dies führt zu blitzschnellen Ladezeiten und einer verbesserten Performance. Darüber hinaus ergeben sich noch weitere Vorteile.",
      "absatz3headline": "Entkopplung von Frontend und Backend",
      "absatz3": "Durch die <strong>Entkopplung von Frontend und Backend</strong> können wir flexibel die besten Tools für jeden Bereich einsetzen. Das Frontend wird als statische Dateien ausgeliefert, während dynamische Funktionen über APIs realisiert werden. Diese Architektur bietet mehrere entscheidende Vorteile:",
      "vorteile": {
        "sicherheit": "<strong>Sicherheit:</strong> Weniger Angriffsfläche durch statische Dateien + kein klassischer Server",
        "performance": "<strong>Performance:</strong> Globale CDN-Verteilung + Vorgerendertes Markup für minimale Ladezeiten",
        "skalierbarkeit": "<strong>Skalierbarkeit (traffic):</strong> Automatische Skalierung ohne Serveradministration (Load Balancing)",
        "skalierbarkeit2": "<strong>Skalierbarkeit (app):</strong> Problemlose Skalierung Ihrer Anwendung oder Webseite",
        "entwicklerfreundlichkeit": "<strong>Entwicklerfreundlichkeit:</strong> Moderne Tools und Workflows + dynamische Community",
        "kosteneffizienz": "<strong>Kosteneffizienz:</strong> Reduzierte Entwicklungs-, Hosting- und Wartungskosten"
      },
      "absatz4headline":"Technologie-Agnostik",
      "absatz4": "Unser Jamstack-Setup besteht aus modernen und innvoativen Tools und Technologien, die sich bewährt haben und perfekt aufeinander abgestimmt sind. Dabei bildet eine <strong>node.js</strong> Frontend-Applikation meist die Grundlage. Angereichert mit Frameworks wie <strong>Svelte/SvelteKit</strong>, <strong>TailwindCSS</strong> oder <strong>DaisyUI</strong> und weiteren npm Paketen, schaffen wir ein Frontend mit unendlichen Möglichkeiten.<br/>Bei all dem bewegen wir uns aber nicht in einem starren Konstrukt, sondern können flexibel auf Integrationswünsche oder andere Technolgiefragen reagieren. Fast alles ist möglich... Des weiteren setzen wir auf <strong>TypeScript</strong> zur typsicheren Programmierung und <strong>Netlify</strong> für Deployment und Hosting. Diese Kombination - unterstützt von <strong>KI-Tools</strong> - ermöglicht es uns, robuste und wartbare Webanwendungen zu entwickeln, die sowohl für Entwickler als auch für Endnutzer optimiert sind. ",
      "absatz5headline":"Headless CMS Integration",
      "absatz5": "Die <strong>Headless CMS-Integration</strong> über GraphQL APIs ermöglicht es unseren Kunden, Inhalte einfach zu verwalten, während die technische Komplexität im Hintergrund verborgen bleibt. So können Sie sich auf Ihr Geschäft konzentrieren, während wir für eine technisch einwandfreie und zukunftssichere Lösung sorgen."
    },
    "projectInsights": {
      "titleFirst": "Wie sieht ein typisches Pojekt bei",
      "titleHighlight": "raspb",
      "titleSecond": " aus"
    }
  }
}
