{
  "privacyNotice": {
    "meta": {
      "title": "Datenschutzerklärung - raspb Webservices",
      "description": "Datenschutzerklärung der raspb Webservices UG (in Gründung)"
    },
    "title": "Datenschutzerklärung",
    "section1": {
      "title": "1. Datenschutz auf einen Blick",
      "generalNotes": {
        "title": "Allgemeine Hinweise",
        "text": "Die folgenden Hinweise geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können. Ausführliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgeführten Datenschutzerklärung."
      },
      "dataCollection": {
        "title": "Datenerfassung auf dieser Website",
        "responsibleTitle": "Wer ist verantwortlich für die Datenerfassung auf dieser Website?",
        "responsibleText": "Die Datenverarbeitung auf dieser Website erfolgt durch den Websitebetreiber. Dessen Kontaktdaten können Sie dem Abschnitt „Hinweis zur Verantwortlichen Stelle\" in dieser Datenschutzerklärung entnehmen.",
        "howCollectedTitle": "Wie erfassen wir Ihre Daten?",
        "howCollectedText1": "Ihre Daten werden zum einen dadurch erhoben, dass Sie uns diese mitteilen. Hierbei kann es sich z. B. um Daten handeln, die Sie in ein Kontaktformular eingeben.",
        "howCollectedText2": "Andere Daten werden automatisch oder nach Ihrer Einwilligung beim Besuch der Website durch unsere IT-Systeme erfasst. Das sind vor allem technische Daten (z. B. Internetbrowser, Betriebssystem oder Uhrzeit des Seitenaufrufs). Die Erfassung dieser Daten erfolgt automatisch, sobald Sie diese Website betreten.",
        "purposeTitle": "Wofür nutzen wir Ihre Daten?",
        "purposeText": "Ein Teil der Daten wird erhoben, um eine fehlerfreie Bereitstellung der Website zu gewährleisten. Andere Daten können zur Analyse Ihres Nutzerverhaltens verwendet werden.",
        "rightsTitle": "Welche Rechte haben Sie bezüglich Ihrer Daten?",
        "rightsText": "Sie haben jederzeit das Recht, unentgeltlich Auskunft über Herkunft, Empfänger und Zweck Ihrer gespeicherten personenbezogenen Daten zu erhalten. Sie haben außerdem ein Recht, die Berichtigung oder Löschung dieser Daten zu verlangen. Wenn Sie eine Einwilligung zur Datenverarbeitung erteilt haben, können Sie diese Einwilligung jederzeit für die Zukunft widerrufen. Außerdem haben Sie das Recht, unter bestimmten Umständen die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Des Weiteren steht Ihnen ein Beschwerderecht bei der zuständigen Aufsichtsbehörde zu."
      }
    },
    "generalNotice": {
      "title": "Allgemeine Hinweise",
      "text": "Die folgenden Hinweise geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können. Ausführliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgeführten Datenschutzerklärung."
    },
    "section2": {
      "title": "2. Hosting",
      "netlify": {
        "title": "Netlify",
        "text1": "Wir hosten unsere Website bei Netlify. Anbieter ist Netlify, Inc., 2325 3rd Street, Suite 296, San Francisco, CA 94107, USA (nachfolgend „Netlify\").",
        "text2": "Wenn Sie unsere Website besuchen, erfasst Netlify verschiedene Logfiles inklusive Ihrer IP-Adressen. Details entnehmen Sie der Datenschutzerklärung von Netlify:",
        "text3": "Die Verwendung von Netlify erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO. Wir haben ein berechtigtes Interesse an einer möglichst zuverlässigen Darstellung unserer Website."
      }
    },
    "section3": {
      "title": "3. Allgemeine Hinweise und Pflichtinformationen",
      "dataProtection": {
        "title": "Datenschutz",
        "text1": "Die Betreiber dieser Seiten nehmen den Schutz Ihrer persönlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend den gesetzlichen Datenschutzbestimmungen sowie dieser Datenschutzerklärung.",
        "text2": "Wenn Sie diese Website benutzen, werden verschiedene personenbezogene Daten erhoben. Personenbezogene Daten sind Daten, mit denen Sie persönlich identifiziert werden können. Die vorliegende Datenschutzerklärung erläutert, welche Daten wir erheben und wofür wir sie nutzen. Sie erläutert auch, wie und zu welchem Zweck das geschieht."
      },
      "responsibleBody": {
        "title": "Hinweis zur verantwortlichen Stelle",
        "text1": "Die verantwortliche Stelle für die Datenverarbeitung auf dieser Website ist:",
        "companyName": "raspb Webservices UG (in Gründung)",
        "name": "Markus Härtig",
        "address": "Am Eselsborn 4a",
        "zipCity": "55286 Sulzheim",
        "phone": "Telefon:",
        "email": "E-Mail:",
        "text2": "Verantwortliche Stelle ist die natürliche oder juristische Person, die allein oder gemeinsam mit anderen über die Zwecke und Mittel der Verarbeitung von personenbezogenen Daten (z. B. Namen, E-Mail-Adressen o. Ä.) entscheidet."
      },
      "storageDuration": {
        "title": "Speicherdauer",
        "text": "Soweit innerhalb dieser Datenschutzerklärung keine speziellere Speicherdauer genannt wurde, verbleiben Ihre personenbezogenen Daten bei uns, bis der Zweck für die Datenverarbeitung entfällt. Wenn Sie ein berechtigtes Löschersuchen geltend machen oder eine Einwilligung zur Datenverarbeitung widerrufen, werden Ihre Daten gelöscht, sofern wir keine anderen rechtlich zulässigen Gründe für die Speicherung Ihrer personenbezogenen Daten haben (z. B. steuer- oder handelsrechtliche Aufbewahrungsfristen); im letztgenannten Fall erfolgt die Löschung nach Fortfall dieser Gründe."
      },
      "withdrawalOfConsent": {
        "title": "Widerruf Ihrer Einwilligung zur Datenverarbeitung",
        "text": "Viele Datenverarbeitungsvorgänge sind nur mit Ihrer ausdrücklichen Einwilligung möglich. Sie können eine bereits erteilte Einwilligung jederzeit widerrufen. Die Rechtmäßigkeit der bis zum Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unberührt."
      },
      "rightToComplain": {
        "title": "Beschwerderecht bei der zuständigen Aufsichtsbehörde",
        "text": "Im Falle von Verstößen gegen die DSGVO steht den Betroffenen ein Beschwerderecht bei einer Aufsichtsbehörde, insbesondere in dem Mitgliedstaat ihres gewöhnlichen Aufenthalts, ihres Arbeitsplatzes oder des Orts des mutmaßlichen Verstoßes zu. Das Beschwerderecht besteht unbeschadet anderweitiger verwaltungsrechtlicher oder gerichtlicher Rechtsbehelfe."
      },
      "rightToDataPortability": {
        "title": "Recht auf Datenübertragbarkeit",
        "text": "Sie haben das Recht, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erfüllung eines Vertrags automatisiert verarbeiten, an sich oder an einen Dritten in einem gängigen, maschinenlesbaren Format aushändigen zu lassen. Sofern Sie die direkte Übertragung der Daten an einen anderen Verantwortlichen verlangen, erfolgt dies nur, soweit es technisch machbar ist."
      }
    },
    "section4": {
      "title": "4. Datenerfassung auf dieser Website",
      "cookies": {
        "title": "Cookies",
        "text1": "Unsere Internetseiten verwenden so genannte „Cookies\". Cookies sind kleine Textdateien und richten auf Ihrem Endgerät keinen Schaden an. Sie werden entweder vorübergehend für die Dauer einer Sitzung (Session-Cookies) oder dauerhaft (permanente Cookies) auf Ihrem Endgerät gespeichert. Session-Cookies werden nach Ende Ihres Besuchs automatisch gelöscht. Permanente Cookies bleiben auf Ihrem Endgerät gespeichert, bis Sie diese selbst löschen oder eine automatische Löschung durch Ihren Webbrowser erfolgt.",
        "text2": "Teilweise können auch Cookies von Drittunternehmen auf Ihrem Endgerät gespeichert werden, wenn Sie unsere Seite betreten (Third-Party-Cookies). Diese ermöglichen uns oder Ihnen die Nutzung bestimmter Dienstleistungen des Drittunternehmens (z. B. Cookies zur Abwicklung von Zahlungsdienstleistungen).",
        "text3": "Cookies haben verschiedene Funktionen. Zahlreiche Cookies sind technisch notwendig, da bestimmte Websitefunktionen ohne diese nicht funktionieren würden (z. B. die Warenkorbfunktion oder die Anzeige von Videos). Andere Cookies dienen dazu, das Nutzerverhalten auszuwerten oder Werbung anzuzeigen.",
        "text4": "Cookies, die zur Durchführung des elektronischen Kommunikationsvorgangs, zur Bereitstellung bestimmter, von Ihnen erwünschter Funktionen (z. B. für die Warenkorbfunktion) oder zur Optimierung der Website (z. B. Cookies zur Messung des Webpublikums) erforderlich sind (notwendige Cookies), werden auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO gespeichert, sofern keine andere Rechtsgrundlage angegeben wird. Der Websitebetreiber hat ein berechtigtes Interesse an der Speicherung von notwendigen Cookies zur technisch fehlerfreien und optimierten Bereitstellung seiner Dienste. Sofern eine Einwilligung zur Speicherung von Cookies und vergleichbaren Wiedererkennungstechnologien abgefragt wurde, erfolgt die Verarbeitung ausschließlich auf Grundlage dieser Einwilligung (Art. 6 Abs. 1 lit. a DSGVO und § 25 Abs. 1 TTDSG); die Einwilligung ist jederzeit widerrufbar."
      },
      "serverLogFiles": {
        "title": "Server-Log-Dateien",
        "text1": "Der Provider der Seiten erhebt und speichert automatisch Informationen in so genannten Server-Log-Dateien, die Ihr Browser automatisch an uns übermittelt. Dies sind:",
        "list": {
          "item1": "Browsertyp und Browserversion",
          "item2": "verwendetes Betriebssystem",
          "item3": "Referrer URL",
          "item4": "Hostname des zugreifenden Rechners",
          "item5": "Uhrzeit der Serveranfrage",
          "item6": "IP-Adresse"
        },
        "text2": "Eine Zusammenführung dieser Daten mit anderen Datenquellen wird nicht vorgenommen.",
        "text3": "Die Erfassung dieser Daten erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO. Der Websitebetreiber hat ein berechtigtes Interesse an der technisch fehlerfreien Darstellung und der Optimierung seiner Website – hierzu müssen die Server-Log-Files erfasst werden."
      },
      "contactForm": {
        "title": "Kontaktformular",
        "text1": "Wenn Sie uns per Kontaktformular Anfragen zukommen lassen, werden Ihre Angaben aus dem Anfrageformular inklusive der von Ihnen dort angegebenen Kontaktdaten zwecks Bearbeitung der Anfrage und für den Fall von Anschlussfragen bei uns gespeichert. Diese Daten geben wir nicht ohne Ihre Einwilligung weiter.",
        "text2": "Die Verarbeitung dieser Daten erfolgt auf Grundlage von Art. 6 Abs. 1 lit. b DSGVO, sofern Ihre Anfrage mit der Erfüllung eines Vertrags zusammenhängt oder zur Durchführung vorvertraglicher Maßnahmen erforderlich ist. In allen übrigen Fällen beruht die Verarbeitung auf unserem berechtigten Interesse an der effektiven Bearbeitung der an uns gerichteten Anfragen (Art. 6 Abs. 1 lit. f DSGVO) oder auf Ihrer Einwilligung (Art. 6 Abs. 1 lit. a DSGVO) sofern diese abgefragt wurde; die Einwilligung ist jederzeit widerrufbar.",
        "text3": "Die von Ihnen im Kontaktformular eingegebenen Daten verbleiben bei uns, bis Sie uns zur Löschung auffordern, Ihre Einwilligung zur Speicherung widerrufen oder der Zweck für die Datenspeicherung entfällt (z. B. nach abgeschlossener Bearbeitung Ihrer Anfrage). Zwingende gesetzliche Bestimmungen – insbesondere Aufbewahrungsfristen – bleiben unberührt."
      }
    },
    "section5": {
      "title": "5. Plugins und Tools",
      "auth0": {
        "title": "Auth0 (Authentifizierung)",
        "text1": "Wir verwenden Auth0 für die Benutzerauthentifizierung auf unserer Website. Anbieter ist Auth0, Inc., 10800 NE 8th Street, Suite 600, Bellevue, WA 98004, USA.",
        "text2": "Wenn Sie sich auf unserer Website registrieren oder anmelden, werden Ihre Anmeldedaten (E-Mail-Adresse, Name, ggf. weitere von Ihnen angegebene Daten) an Auth0 übertragen und dort verarbeitet. Auth0 speichert diese Daten zur Bereitstellung der Authentifizierungsdienste.",
        "text3": "Die Datenübertragung erfolgt auf Grundlage von Art. 6 Abs. 1 lit. b DSGVO (Vertragserfüllung) und Art. 6 Abs. 1 lit. f DSGVO (berechtigtes Interesse an sicherer Benutzerauthentifizierung).",
        "text4": "Details zur Datenverarbeitung durch Auth0 finden Sie in der Datenschutzerklärung von Auth0:"
      },
      "hygraph": {
        "title": "Hygraph (Content Management)",
        "text1": "Wir verwenden Hygraph (ehemals GraphCMS) als Content Management System. Anbieter ist Hygraph GmbH, Zimmerstraße 23, 10969 Berlin, Deutschland.",
        "text2": "Über Hygraph werden Inhalte unserer Website verwaltet und bereitgestellt. Dabei können technische Daten wie IP-Adressen und Zugriffsdaten verarbeitet werden.",
        "text3": "Die Datenverarbeitung erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO (berechtigtes Interesse an der technischen Bereitstellung der Website).",
        "text4": "Details zur Datenverarbeitung durch Hygraph finden Sie in der Datenschutzerklärung von Hygraph:"
      }
    },
    "section6": {
      "title": "6. Ihre Rechte",
      "intro": "Sie haben folgende Rechte bezüglich Ihrer personenbezogenen Daten:",
      "rights": {
        "rightToInformation": "Recht auf Auskunft: Sie können Auskunft über die von uns verarbeiteten personenbezogenen Daten verlangen.",
        "rightToCorrection": "Recht auf Berichtigung: Sie haben das Recht, unrichtige Daten berichtigen zu lassen.",
        "rightToDeletion": "Recht auf Löschung: Sie können die Löschung Ihrer Daten verlangen, sofern keine gesetzlichen Aufbewahrungspflichten bestehen.",
        "rightToRestriction": "Recht auf Einschränkung: Sie können die Einschränkung der Verarbeitung verlangen.",
        "rightToDataPortability": "Recht auf Datenübertragbarkeit: Sie haben das Recht, Ihre Daten in einem strukturierten Format zu erhalten.",
        "rightToObject": "Widerspruchsrecht: Sie können der Verarbeitung Ihrer Daten widersprechen."
      },
      "contact": "Zur Ausübung Ihrer Rechte wenden Sie sich bitte an:"
    },
    "section7": {
      "title": "7. Änderungen dieser Datenschutzerklärung",
      "text": "Wir behalten uns vor, diese Datenschutzerklärung anzupassen, damit sie stets den aktuellen rechtlichen Anforderungen entspricht oder um Änderungen unserer Leistungen in der Datenschutzerklärung umzusetzen, z. B. bei der Einführung neuer Services. Für Ihren erneuten Besuch gilt dann die neue Datenschutzerklärung.",
      "status": "Stand:",
      "date": "Oktober 2025"
    },
    "backToHomepage": "Zurück zur Startseite"
  }
}
