{
  "insights": {
    "meta": {
      "title": "raspb Webservices - Insights",
      "description": "Here can be a description..."
    },
    "header": {
      "title": "Insights into",
      "titleHighlight": "our way of working",
      "teaser": "Trust and transparency are important for a good customer relationship. Here we would like to provide insights into our work and a typical project process, so that it is crystal clear what you can expect."
    },
    "webtechnologien": {
      "titleFirst": "We leverage",
      "titleHighlight": "modern web technologies",
      "titleSecond": "",
      "subtitle": "We have developed our own technology stack based on the Jamstack that makes everything simpler, faster and more efficient without having to accept limitations.",
      "absatz1headline": "What exactly is the Jamstack?",
      "absatz1": "<strong>Jamstack</strong> stands for JavaScript, APIs and Markup and represents a modern architecture for web development. This technology enables us to create extremely fast, secure and scalable websites and applications that provide an exceptional user experience.",
      "absatz2headline": "Unprecedented performance",
      "absatz2": "The core of the Jamstack approach lies in the <strong>pre-rendering</strong> of content. Instead of creating pages dynamically with each request, all pages are already generated at build time and delivered via a Content Delivery Network (CDN). This leads to lightning-fast loading times and improved performance. And there are a lot more benefits.",
      "absatz3headline": "Decoupling frontend and backend",
      "absatz3": "By <strong>decoupling frontend and backend</strong>, we can flexibly use the best tools for each area. The frontend is delivered as static files, while dynamic functions are implemented via APIs. This architecture offers several decisive advantages:",
      "vorteile": {
        "sicherheit": "<strong>Security:</strong> Less attack surface through static files",
        "performance": "<strong>Performance:</strong> Global CDN distribution for minimal loading times",
        "skalierbarkeit": "<strong>Scalability:</strong> Automatic scaling without server administration",
        "entwicklerfreundlichkeit": "<strong>Developer-friendly:</strong> Modern development tools and workflows",
        "kosteneffizienz": "<strong>Cost efficiency:</strong> Reduced hosting and maintenance costs"
      },
      "absatz4headline":"Technologie-Agnostik",
      "absatz4": "Our Jamstack setup includes modern technologies like <strong>Svelte/SvelteKit</strong> for the frontend, <strong>TypeScript</strong> for type-safe development, <strong>Tailwind CSS</strong> for efficient styling and <strong>Netlify</strong> for deployment and hosting. This combination enables us to develop robust and maintainable web applications that are optimized for both developers and end users.",
      "absatz5headline":"Technologie-Agnostik",
      "absatz5": "The <strong>Headless CMS integration</strong> via GraphQL APIs enables our customers to easily manage content while the technical complexity remains hidden in the background. This way you can focus on your business while we ensure a technically flawless and future-proof solution."
    },
    "projectInsights": {
      "titleFirst": "How does a typical project with",
      "titleHighlight": "raspb",
      "titleSecond": "look like"
    }
  }
}
