{
  "insights": {
    "meta": {
      "title": "raspb Webservices - Insights",
      "description": "Here can be a description..."
    },
    "header": {
      "title": "Insights into",
      "titleHighlight": "our way of working",
      "teaser": "Trust and transparency are important for a good customer relationship. Here we would like to provide insights into our work and a typical project process, so that it is crystal clear what you can expect."
    },
    "webtechnologien": {
      "title": "We leverage modern web technologies",
      "titleFirst": "We leverage",
      "titleHighlight": "modern web technologies",
      "titleSecond": "",
      "subtitle": "We have developed our own technology stack based on the Jamstack that makes everything simpler, faster and more efficient without having to accept limitations.",
      "absatz1headline": "What exactly is the Jamstack?",
      "absatz1": "<strong>Jamstack</strong> stands for JavaScript, APIs and Markup and represents a modern architecture for web development. This technology enables us to create extremely fast, secure and scalable websites and applications that provide an exceptional user experience.",
      "absatz2headline": "Unprecedented performance",
      "absatz2": "The core of the Jamstack approach lies in the <strong>pre-rendering</strong> of content. Instead of creating pages dynamically with each request, all pages are already generated at build time and delivered via a Content Delivery Network (CDN). This leads to lightning-fast loading times and improved performance. And there are a lot more benefits.",
      "absatz3headline": "Decoupling frontend and backend",
      "absatz3": "By <strong>decoupling frontend and backend</strong>, we can flexibly use the best tools for each area. The frontend is delivered as static files, while dynamic functions are implemented via APIs. This architecture offers several decisive advantages:",
      "vorteile": {
        "sicherheit": "<strong>Security:</strong> Less attack surface through static files",
        "performance": "<strong>Performance:</strong> Global CDN distribution for minimal loading times",
        "skalierbarkeit": "<strong>Scalability:</strong> Automatic scaling without server administration",
        "entwicklerfreundlichkeit": "<strong>Developer-friendly:</strong> Modern development tools and workflows",
        "kosteneffizienz": "<strong>Cost efficiency:</strong> Reduced hosting and maintenance costs"
      },
      "absatz4headline":"Technology agnostic",
      "absatz4": "Our Jamstack setup consists of modern and innovative tools and technologies that have proven themselves and are perfectly coordinated with each other. A <strong>Node.js</strong> frontend application usually forms the basis. Enriched with frameworks like <strong>Svelte/SvelteKit</strong>, <strong>TailwindCSS</strong> or <strong>DaisyUI</strong> and other npm packages, we create a frontend with endless possibilities.<br/><br/>In all of this, however, we do not move in a rigid construct, but can flexibly respond to integration requests or other technology questions. Almost everything is possible... Furthermore, we use <strong>TypeScript</strong> for type-safe programming and <strong>Netlify</strong> for deployment and hosting. This combination - supported by <strong>AI tools</strong> - enables us to develop robust and maintainable web applications that are optimized for both developers and end users.",
      "absatz5headline":"Headless CMS Integration",
      "absatz5": "The <strong>Headless CMS integration</strong> via GraphQL APIs enables our customers to easily manage content while the technical complexity remains hidden in the background. This way you can focus on your business while we ensure a technically flawless and future-proof solution."
    },
    "projectInsights": {
      "titleFirst": "How does a typical project with",
      "titleHighlight": "raspb",
      "titleSecond": "look like",
      "paragraph1": "You can find the easy start to your upcoming IT project on our website. By submitting the project configurator, the first big step is already done. To be able to use the intelligent configurator to its full extent, you only need to create a simple account (email address is sufficient). The planned project will then be available in your personal dashboard and can be refined there and finally submitted to us.",
      "paragraph2": "You will immediately receive an email with all the details and can officially start and commission us with one click. <strong>This starts the journey!</strong> We immediately deal with your idea, develop a concept and a first prototype. For each project, a separate mailbox <projectname>@raspb.de is set up, which is used for creating all accounts. You get access to the mailbox + access to the emails via browser / webmailer. A GitHub account is set up, which carries the project code and creates its own site in Netlify. Depending on the project type, a Hygraph and auth0 account is added. Usually access happens via SSO from the GitHub account.",
      "paragraph3": "Depending on the project scope and customer wishes, we refine your vision together in small workshops or web sessions. What we definitely want to avoid is scheduling many time-consuming meetings that usually offer little benefit. Your input from the configurator, as well as our extensive experience from IT projects, enable us to understand and implement your idea/vision without many loops. If you are still unsure between project configuration and commissioning, have questions or need dialogue for other reasons, we are of course available at any time. But let's keep it efficient and lean - for everyone's benefit.",
      "paragraph4": "You have full access to all systems - even during the project process. We now work on your project within the created GitHub repository and make it available via a temporary address: <projectname>.netlify.app. You get all access data directly and are informed about every step in your dashboard and by mail.",
      "paragraph5": "For CMS projects, we will do several iterations with you to coordinate the data model and other specifics. Simple websites usually don't require additional coordination rounds. You will receive a first prototype within a few days. For more complex projects, such as special applications or individual developments, it may take a bit longer until we can present a first prototype.",
      "paragraph6": "You now have sufficient time to test the prototype and give us feedback. Via the dashboard, you also have the opportunity at any time to provide additional project artifacts or influence the development.",
      "paragraph7": "With the collected feedback, we go into revision / fine-tuning. After a few more days, the go-live capable final version is ready. In coordination with you, we publish the result under the desired domain. Alternatively, we deliver the code to you or transport the application to your desired location. This successfully completes the project.",
      "paragraph8": "But that's not all. The structure of our solutions is modular, flexible and expandable. The end of your project is the beginning of another..."
    },
    "kiSection": {
      "title": "And what about AI now?",
      "paragraph1": "Artificial Intelligence is an impressive tool that can accelerate the completion of certain tasks by 10 times. It enables us to offer our customized IT projects so efficiently (project duration, costs, etc.). But it doesn't work without humans: Creativity, experience, deep understanding of human needs, emotions,... All of this cannot be replaced! Furthermore, it requires experienced people who give the AI models the right instructions (prompts) and control their output. Because sometimes AIs deliver things that weren't asked for (hallucinate) or deliver results with serious errors. Even if many models can now create entire applications with just one prompt, a human expert is needed for truly perfect results.",
      "paragraph2": "In addition to prompt and context engineering (How can I feed an AI as best as possible so that exactly what I want comes out?) there are many other use cases where the use of AI - in one form or another - is obvious: Chatbots, AI agents, AI workflows, AI enhanced automations, content creation, personal assistant, etc.",
      "paragraph3": "We have discovered n8n as an automation platform for ourselves. This allows scenarios from all areas of AI to be implemented simply and efficiently. In addition to individual AI consulting services, we also offer the development of special agents and workflows that help you achieve your business goals and save costs. For our AI projects (and partly also for our individual developments), the standardized project process cannot be applied 100%. Usually the project times are a bit longer here and closer coordination is a prerequisite. And yet the unique raspb approach offers unique efficiency here as well. Results of AI projects are available much earlier than with other providers."
    }
  }
}
